//WALLY JOB 'IBMUSER',CLASS=A,NOTIFY=&SYSUID,MSGCLASS=H
//ZFSALLOC EXEC PGM=IDCAMS,REGION=0M
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER( -
       NAME(ZFS.IBM.SERVICE.INSTALL) -
       VOLUME(SPRK01,USER01,USER02,USER03) -
       LINEAR -
       CYL(5000 20) -
       SHAREOPTIONS(3) -
            )
/*
//ZFSFORMT EXEC PGM=IOEAGFMT,REGION=0M,COND=(0,LT,ZFSALLOC),
//        PARM='-aggregate ZFS.IBM.SERVICE.INSTALL -compat'
//SYSPRINT DD SYSOUT=*